backend/app/models/order.rb

INSERT INTO "status_histories" ("order_id", "from_status", "to_status", "comment", "created_by", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create_initial_status_history
    status_histories.create(to_status: status, created_by: 'system')